Revit 2027 API
MEPNetworkIterator.GetOtherAnalyticalNode Method
 Gets the other analytical node at the current iteration step.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPAnalyticalNode GetOtherAnalyticalNode()
Public Function GetOtherAnalyticalNode As MEPAnalyticalNode
public:
MEPAnalyticalNode^ GetOtherAnalyticalNode()
member GetOtherAnalyticalNode : unit -> MEPAnalyticalNode
Return Value
MEPAnalyticalNode
 The retrieved analytical node, null if the current iteration step does not have additional analytical node.
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace